{
  "metadata": {
    "version": "1.0.0",
    "lastUpdated": 1704067200000,
    "totalEntries": 200,
    "source": "verified-knowledge-base"
  },
  "facts": {
    "artificial intelligence": {
      "content": "Artificial Intelligence (AI) is the simulation of human intelligence in machines that are programmed to think and learn like humans. It encompasses machine learning, natural language processing, computer vision, and robotics.",
      "source": "scientific-consensus",
      "category": "technology",
      "relatedTopics": ["machine learning", "neural networks", "robotics", "computer science"],
      "verified": true,
      "sources": ["academic", "research"],
      "lastUpdated": "2025-01-08T00:00:00Z"
    },
    "quantum physics": {
      "content": "Quantum physics is the branch of physics that studies matter and energy at the smallest scales, typically at the level of atoms and subatomic particles. It reveals that energy, momentum, angular momentum, and other quantities are restricted to discrete values (quantized).",
      "source": "scientific-consensus",
      "category": "science",
      "relatedTopics": ["quantum mechanics", "particle physics", "wave-particle duality", "uncertainty principle"]
    },
    "consciousness": {
      "content": "Consciousness refers to the state of being aware of and able to think about one's existence, sensations, thoughts, and surroundings. It remains one of the greatest mysteries in science and philosophy, with ongoing debates about its nature and origins.",
      "source": "scientific-consensus",
      "category": "philosophy",
      "relatedTopics": ["awareness", "cognition", "philosophy of mind", "neuroscience"]
    },
    "tesla": {
      "content": "Nikola Tesla (1856-1943) was a Serbian-American inventor, electrical engineer, mechanical engineer, and futurist best known for his contributions to the design of the modern alternating current (AC) electricity supply system. He held over 300 patents and made groundbreaking discoveries in electromagnetism.",
      "source": "historical-record",
      "category": "history",
      "relatedTopics": ["electricity", "invention", "alternating current", "wireless technology"]
    },
    "mathematics": {
      "content": "Mathematics is the abstract science of number, quantity, and space, either as abstract concepts or as applied to other disciplines such as physics and engineering. It includes arithmetic, algebra, geometry, calculus, statistics, and many other specialized fields.",
      "source": "academic-consensus",
      "category": "science",
      "relatedTopics": ["numbers", "geometry", "algebra", "calculus", "statistics"]
    },
    "programming": {
      "content": "Computer programming is the process of creating a set of instructions that tell a computer how to perform a task. Programming can be done using a variety of computer programming languages, such as JavaScript, Python, Java, C++, and many others.",
      "source": "technical-documentation",
      "category": "technology",
      "relatedTopics": ["software development", "algorithms", "coding", "computer science"]
    },
    "philosophy": {
      "content": "Philosophy is the study of general and fundamental questions about existence, knowledge, values, reason, mind, and language. It is distinguished from other ways of addressing such problems by its critical, generally systematic approach and its reliance on rational argument.",
      "source": "academic-consensus",
      "category": "philosophy",
      "relatedTopics": ["ethics", "metaphysics", "epistemology", "logic", "aesthetics"]
    },
    "science": {
      "content": "Science is a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe. It encompasses physics, chemistry, biology, earth sciences, and many other fields of study.",
      "source": "scientific-method",
      "category": "science",
      "relatedTopics": ["research", "experimentation", "hypothesis", "theory", "evidence"]
    },
    "machine learning": {
      "content": "Machine Learning is a subset of AI that enables computers to learn and improve from experience without being explicitly programmed. It uses algorithms to analyze data, identify patterns, and make predictions.",
      "category": "technology",
      "verified": true,
      "sources": ["academic", "research"],
      "lastUpdated": "2025-01-08T00:00:00Z"
    },
    "neural networks": {
      "content": "Neural networks are computing systems inspired by biological neural networks. They consist of interconnected nodes (neurons) that process information and can learn to recognize patterns, classify data, and make decisions.",
      "category": "technology",
      "verified": true,
      "sources": ["academic", "research"],
      "lastUpdated": "2025-01-08T00:00:00Z"
    }
  }
}
