{
  "metadata": {
    "version": "1.0.0",
    "lastUpdated": "2024-01-01T00:00:00Z",
    "totalConcepts": 200,
    "sources": ["Stanford Encyclopedia of Philosophy", "Philosophy Texts", "Academic Papers"]
  },
  "concepts": [
    {
      "id": "ethics_utilitarianism",
      "name": "Utilitarianism",
      "description": "A moral theory that judges the rightness of actions based on their consequences, specifically their ability to produce the greatest happiness for the greatest number of people.",
      "philosopher": "Jeremy Bentham, John Stuart Mill",
      "school": "Consequentialism",
      "relatedConcepts": ["hedonism", "consequentialism", "moral_calculus"],
      "arguments": [
        "Actions should be judged by their outcomes, not intentions",
        "The greatest good for the greatest number is the moral ideal",
        "Happiness and pleasure are intrinsically valuable",
        "Moral decisions can be calculated objectively"
      ],
      "counterArguments": [
        "It can justify harmful actions if they benefit the majority",
        "Difficult to measure and compare different types of happiness",
        "Ignores individual rights and justice",
        "May lead to tyranny of the majority"
      ]
    },
    {
      "id": "metaphysics_free_will",
      "name": "Free Will",
      "description": "The philosophical concept that humans have the ability to make choices that are genuinely their own, not entirely determined by prior causes.",
      "philosopher": "Various",
      "school": "Metaphysics",
      "relatedConcepts": ["determinism", "moral_responsibility", "consciousness"],
      "arguments": [
        "We experience making genuine choices in our daily lives",
        "Moral responsibility requires the ability to have acted differently",
        "Quantum indeterminacy may provide room for free will",
        "Agent causation allows for self-determined actions"
      ],
      "counterArguments": [
        "Physical determinism suggests all events are causally determined",
        "Neuroscience shows brain activity precedes conscious decisions",
        "Our choices are shaped by genetics and environment",
        "Random events don't constitute free will"
      ]
    },
    {
      "id": "epistemology_skepticism",
      "name": "Skepticism",
      "description": "The philosophical position that questions the possibility of certain knowledge, arguing that we should suspend judgment on claims that cannot be proven with certainty.",
      "philosopher": "Pyrrho, Sextus Empiricus, David Hume",
      "school": "Epistemology",
      "relatedConcepts": ["knowledge", "certainty", "doubt", "empiricism"],
      "arguments": [
        "Our senses can deceive us, making empirical knowledge uncertain",
        "We cannot step outside our own perspective to verify truth",
        "Infinite regress problem: every justification requires further justification",
        "Dream argument: we cannot distinguish waking from dreaming"
      ],
      "counterArguments": [
        "Practical certainty is sufficient for knowledge",
        "Skepticism is self-refuting if applied consistently",
        "Common sense and successful predictions support our beliefs",
        "Methodological doubt can lead to foundational truths"
      ]
    }
  ]
}
